Model: "SimpleSegmentationModel"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 512, 1024, 3)]    0         
                                                                 
 conv2d (Conv2D)             (None, 512, 1024, 32)     896       
                                                                 
 batch_normalization (Batch  (None, 512, 1024, 32)     128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 256, 512, 32)      0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 256, 512, 64)      18496     
                                                                 
 batch_normalization_1 (Bat  (None, 256, 512, 64)      256       
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 128, 256, 64)      0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 128, 256, 128)     73856     
                                                                 
 batch_normalization_2 (Bat  (None, 128, 256, 128)     512       
 chNormalization)                                                
                                                                 
 up_sampling2d (UpSampling2  (None, 256, 512, 128)     0         
 D)                                                              
                                                                 
 conv2d_3 (Conv2D)           (None, 256, 512, 64)      73792     
                                                                 
 batch_normalization_3 (Bat  (None, 256, 512, 64)      256       
 chNormalization)                                                
                                                                 
 up_sampling2d_1 (UpSamplin  (None, 512, 1024, 64)     0         
 g2D)                                                            
                                                                 
 conv2d_4 (Conv2D)           (None, 512, 1024, 32)     18464     
                                                                 
 batch_normalization_4 (Bat  (None, 512, 1024, 32)     128       
 chNormalization)                                                
                                                                 
 segmentation_output (Conv2  (None, 512, 1024, 8)      264       
 D)                                                              
                                                                 
=================================================================
Total params: 187048 (730.66 KB)
Trainable params: 186408 (728.16 KB)
Non-trainable params: 640 (2.50 KB)
_________________________________________________________________
